fixtures/vcr_cassettes/StripeWrapper/StripeWrapper_Charge/_create/with_a_valid_card/charges_the_correct_amount.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=6&card[exp_year]=2018&card[cvc]=314
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.22.0
      Authorization:
      - Bearer sk_test_OyguaVei81Gg7bCwTjl5BO7l
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.22.0","lang":"ruby","lang_version":"2.1.6 p336 (2015-04-13)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 3.14.13-c9 (root@463f376ad33b) (gcc version 4.7.2 (Debian 4.7.2-5)
        ) #1 SMP Tue Aug 19 16:13:44 UTC 2014","hostname":"tomtl-myflix-1565063"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 26 Jun 2015 17:34:23 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '781'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_2bqCqlPcsGUw3v39
      Stripe-Version:
      - '2015-06-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_16I0iZIgCm8hkqAL8fVamR35",
          "livemode": false,
          "created": 1435340063,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_16I0iZIgCm8hkqALHR6RTJDt",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 6,
            "exp_year": 2018,
            "fingerprint": "Co17IYkKBYatKAgX",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "unchecked",
            "address_line1_check": null,
            "address_zip_check": null,
            "tokenization_method": null,
            "dynamic_last4": null,
            "metadata": {}
          },
          "client_ip": "130.211.176.26"
        }
    http_version: 
  recorded_at: Fri, 26 Jun 2015 17:34:23 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=999&currency=usd&source=tok_16I0iZIgCm8hkqAL8fVamR35&description=A%20valid%20charge
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.22.0
      Authorization:
      - Bearer sk_test_OyguaVei81Gg7bCwTjl5BO7l
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.22.0","lang":"ruby","lang_version":"2.1.6 p336 (2015-04-13)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 3.14.13-c9 (root@463f376ad33b) (gcc version 4.7.2 (Debian 4.7.2-5)
        ) #1 SMP Tue Aug 19 16:13:44 UTC 2014","hostname":"tomtl-myflix-1565063"}'
      Content-Length:
      - '90'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 26 Jun 2015 17:34:24 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1435'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_urSInTQBZxDBTjdM
      Stripe-Version:
      - '2015-06-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_16I0iaIgCm8hkqALX58tbhwu",
          "object": "charge",
          "created": 1435340064,
          "livemode": false,
          "paid": true,
          "status": "succeeded",
          "amount": 999,
          "currency": "usd",
          "refunded": false,
          "source": {
            "id": "card_16I0iZIgCm8hkqALHR6RTJDt",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 6,
            "exp_year": 2018,
            "fingerprint": "Co17IYkKBYatKAgX",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": null,
            "address_zip_check": null,
            "tokenization_method": null,
            "dynamic_last4": null,
            "metadata": {},
            "customer": null
          },
          "captured": true,
          "balance_transaction": "txn_16I0iaIgCm8hkqALFkoI0x8s",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": null,
          "invoice": null,
          "description": "A valid charge",
          "dispute": null,
          "metadata": {},
          "statement_descriptor": null,
          "fraud_details": {},
          "receipt_email": null,
          "receipt_number": null,
          "shipping": null,
          "destination": null,
          "application_fee": null,
          "refunds": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/charges/ch_16I0iaIgCm8hkqALX58tbhwu/refunds",
            "data": []
          }
        }
    http_version: 
  recorded_at: Fri, 26 Jun 2015 17:34:24 GMT
recorded_with: VCR 2.9.3
